
namespace BattleDrakeStudios.ModularCharacters {
    public enum ModularBodyPart {
        头盔 = 0,
        头部附件 = 1,
        帽子 = 2,
        面具 = 3,
        头套 = 4,

        背部附件 = 5,
        躯干 = 6,
        右侧肩部附件 = 7,
        左侧肩部附件 = 8 ,
        右侧上臂 = 9 ,
        左侧上臂 = 10,
        臀部_腰部附件 = 11,
        臀部_腰部 = 12,

        右侧手臂关节 = 13,
        左侧手臂关节 = 14,
        右侧下臂 = 15,
        左侧下臂 = 16,
        右手 = 17,
        左手 = 18,

        右侧膝盖 = 19,
        左侧膝盖 = 20,
        右脚 = 21,
        左脚 = 22,
        
        头部 = 23,
        头发 = 24,
        眉 = 25,
        耳朵 = 26,
        面部毛发 = 27,
        Max = 28,
    }
}
